Repository: kazu09/calaryIOS
Catalog: calary/calary/Resources/Localizable.xcstrings
Source language: ja
Languages: en

# common.cancel
source: キャンセル
en: Cancel

# common.close
source: 閉じる
en: Close

# common.delete
source: 削除
en: Delete

# common.edit
source: 編集
en: Edit

# common.error.load.title
source: 読み込みエラー
en: Unable to Load

# common.error.save.message
source: 保存できませんでした。時間をおいて、もう一度お試しください。
en: Couldn’t save your changes. Please wait a moment and try again.

# common.error.save.title
source: 保存エラー
en: Unable to Save

# common.save
source: 保存
en: Save

# common.selection.none
source: 選択なし
en: None

# debug.database.dump.action
source: DBの中身をログ出力
en: Print Database Contents

# debug.database.dump.error.title
source: ログ出力エラー
en: Print Failed

# debug.database.dump.success.message
source: XcodeコンソールへDBの内容を出力しました。
en: The database contents were printed to the Xcode console.

# debug.database.dump.success.title
source: ログ出力完了
en: Print Complete

# debug.database.section.footer
source: SwiftDataに保存されている全データをXcodeコンソールへ出力します。
en: Prints all data stored in SwiftData to the Xcode console.

# debug.database.section.title
source: データベース
en: Database

# debug.title
source: デバッグ
en: Debug

# diary.create.action
source: 日記を新規作成
en: Create Diary Entry

# diary.create.title
source: 日記を新規作成
en: New Diary Entry

# diary.delete.confirmation.message
source: 日記に登録した単語も削除されます。
en: Words added from this diary entry will also be deleted.

# diary.delete.confirmation.title
source: この日記を削除しますか？
en: Delete this diary entry?

# diary.detail.title
source: 日記詳細
en: Diary Entry

# diary.edit.title
source: 日記を編集
en: Edit Diary Entry

# diary.empty.message
source: 右下の＋から日記を書いてみよう！
en: Tap + in the bottom-right corner to write your first entry!

# diary.empty.title
source: 日記がありません
en: No Diary Entries

# diary.field.date
source: 日付
en: Date

# diary.field.english.placeholder
source: 英語で日記を書いてください
en: Write your diary entry in English

# diary.field.japanese
source: 日本語
en: Japanese

# diary.field.japanese.placeholder
source: 日本語で日記を書いてください
en: Write your diary entry in Japanese

# diary.field.tag
source: 日記タグ
en: Diary Tag

# diary.field.tag.none
source: タグなし
en: No Tag

# diary.field.teacher_question
source: 先生への質問
en: Question for Your Teacher

# diary.field.teacher_question.placeholder
source: 先生に確認したいことがあれば入力してください
en: Enter anything you’d like to ask your teacher

# diary.question.status.answered
source: 回答済み
en: Answered

# diary.question.status.toggle.hint
source: タップして回答状態を切り替えます
en: Tap to change the answer status

# diary.question.status.unanswered
source: 未回答
en: Unanswered

# grammar.add.action
source: 英文法メモを追加
en: Add Grammar Note

# grammar.add.title
source: 英文法メモを追加
en: Add Grammar Note

# grammar.delete.confirmation.title
source: この英文法メモを削除しますか？
en: Delete this grammar note?

# grammar.detail.title
source: 英文法メモ詳細
en: Grammar Note

# grammar.detail.updated_at %@
source: 更新日：%1$@
en: Updated: %1$@

# grammar.edit.title
source: 英文法メモを編集
en: Edit Grammar Note

# grammar.empty.message
source: 右下の＋からメモを追加してみよう！
en: Tap + in the bottom-right corner to add a note!

# grammar.empty.title
source: 英文法メモがありません
en: No Grammar Notes

# grammar.field.content
source: メモ
en: Note

# grammar.field.content.placeholder
source: 文法の使い方や例文を入力してください
en: Enter a grammar explanation or example sentences

# grammar.field.title
source: タイトル
en: Title

# grammar.field.title.placeholder
source: 例：現在完了形（have been）
en: Example: Present perfect (have been)

# grammar.title
source: 英文法メモ
en: Grammar Notes

# settings.app_version.description
source: 現在のアプリバージョンを確認できます。
en: Check the current app version.

# settings.app_version.detail
source: 現在のバージョン情報を確認する仮画面です。
en: This is a placeholder for the current version information.

# settings.app_version.title
source: アプリバージョン
en: App Version

# settings.debug.description
source: 開発者用のデバッグ画面に遷移します。
en: Open the developer debug menu.

# settings.help.description
source: 使い方やよくある質問を確認できます。
en: View instructions and frequently asked questions.

# settings.help.detail
source: 使い方やよくある質問を確認する仮画面です。
en: This is a placeholder for help and frequently asked questions.

# settings.help.title
source: ヘルプ
en: Help

# settings.terms.description
source: アプリの利用条件やポリシーを確認できます。
en: Review the app’s terms and policies.

# settings.terms.detail
source: 利用規約を確認する仮画面です。
en: This is a placeholder for the terms of service.

# settings.terms.title
source: 利用規約
en: Terms of Service

# settings.title
source: 設定
en: Settings

# tab.grammar
source: 英文法
en: Grammar

# tab.home
source: ホーム
en: Home

# tab.settings
source: 設定
en: Settings

# tab.word
source: 単語
en: Words

# word.add.action
source: 単語を追加
en: Add Word

# word.add.title
source: 単語を追加
en: Add Word

# word.detail.title
source: 単語詳細
en: Word Details

# word.edit.title
source: 単語を編集
en: Edit Word

# word.empty.message
source: 保存済みの日記詳細から単語を追加しよう！
en: Add words from the details screen of a saved diary entry!

# word.empty.title
source: 単語がありません
en: No Words

# word.field.japanese_meaning
source: 日本語訳
en: Japanese Meaning

# word.field.japanese_meaning.placeholder
source: 例：本、予約する
en: Example: 本, 予約する

# word.field.part_of_speech
source: 品詞
en: Part of Speech

# word.field.part_of_speech.optional
source: 品詞（任意）
en: Part of Speech (Optional)

# word.field.word
source: 英単語
en: English Word

# word.field.word.placeholder
source: 例：book
en: Example: book

# word.meaning.add.action
source: 意味を追加
en: Add Meaning

# word.meaning.delete.label %lld
source: 意味%1$lldを削除
en: Delete meaning %1$lld

# word.meaning.number %lld
source: 意味 %1$lld
en: Meaning %1$lld

# word.part_of_speech.adjective
source: 形容詞
en: Adjective

# word.part_of_speech.adverb
source: 副詞
en: Adverb

# word.part_of_speech.noun
source: 名詞
en: Noun

# word.part_of_speech.other
source: その他
en: Other

# word.part_of_speech.verb
source: 動詞
en: Verb

# word.source_diary.date %@
source: %1$@ の日記より
en: From the diary entry on %1$@

# word.source_diary.none
source: 登録元の日記なし
en: No Source Diary Entry

# word.source_diary.title
source: 登録元の日記
en: Source Diary Entry

# word.title
source: 単語
en: Words
